const products = [
    {
        id: 6,

        name: "Капри",

        category: "Модульные гостиные",

        price: "8000 ₽",

        preview: "images/products/photo_2026-02-28_19-57-04.jpg",

        images: [
            "images/products/photo_2026-02-28_19-57-04.jpg"
        ],

        description: "Современная модульная гостиная «Капри». Отлично подходит для квартиры или дома.",

        specs: {

            "Размер": "2100 × 1820 × 420 мм",

            "Материал": "ЛДСП",

            "Направляющие": "Шариковые",

            "Ниша под ТВ": "975 × 825 × 425 мм",

            "Гарантия": "12 месяцев",

            "Цвет": "Любой"

        }

    }
];