const products = [
    {
        id: 1,
        name: "Капри Гостиная",
        category: "Гостиные",
        subcategory: "Гостиные без шкафа",
        price: "16 000 ₽",
        preview: "images/products/Капри/kapri.jpg",
        images: [
            "images/products/Капри/kapri.jpg",
            "images/products/Капри/kapri1.jpg"
        ], 
        description: "Современная гостиная без шкафа «Капри». Отлично подходит для квартиры или дома.",
        specs: {

            "Размер": "2100 × 1820 × 420 мм",
            "Материал": "ЛДСП",
            "Направляющие": "Шариковые",
            "Ниша под ТВ": "975 × 825 × 425 мм",
            "Гарантия": "12 месяцев",
            "Цвет корпуса": "Ясень шимо темный",
            "Цвет фасада": "Ясень шимо светлый"
        }
    },
    {
        id: 2,
        name: "Моника Гостиная - 3",
        category: "Гостиные",
        subcategory: "Гостиные без шкафа",
        price: "25 000 ₽",
        preview: "images/products/Моника Гостиная - 3/monika3.jpg",
        images: [
            "images/products/Моника Гостиная - 3/monika3.jpg",
            "images/products/Моника Гостиная - 3/monika3(1).jpg"
        ],
        description: "Современная гостиная без шкафа «Моника». Отлично подходит для квартиры или дома.",
        specs: {
            "Размер": "2000 х 1750 х 500 мм",
            "Направляющие": "Шариковые без доводчиков",
            "Материал": "ЛДСП / ЛДСП",
            "Ниша под ТВ": "1200х900",
            "Гарантия": "18 месяцев",
            "Цвет корпуса": "Айрон рок",
            "Цвет фасада": "Белый лофт"
        }
    },
    {
        id: 3,
        name: "Марта-М Гостиная",
        category: "Гостиные",
        subcategory: "Гостиные со шкафом",
        price: "30 000p",
        preview: "images/products/Марта-М Гостиная/marta.jpg",
        images: [
            "images/products/Марта-М Гостиная/marta.jpg",
            "images/products/Марта-М Гостиная/marta1.jpg"
        ],
        description: "Современная гостиная со шкафом «Марта». Отлично подходит для квартиры или дома.",
        specs: {
            "Размер": "2700х2125х475 мм",
            "Направляющие": "Роликовые",
            "Материал": "ЛДСП / ЛДСП",
            "Ниша под ТВ": "935х810х405",
            "Гарантия": "12 месяцев",
            "Цвет корпуса": "Венге",
            "Цвет фасада": "Дуб белфорт"
        }
    },
    {
        id:4,
        name: "Квинта Гостиная 1,6 м ●▶",
        category: "Гостиные",
        subcategory: "Гостиные без шкафа",
        price: "17 000p",
        preview: "images/products/Квинта Гостиная 1,6 м ●▶/kvinta.jpg",
        images: [
            "images/products/Квинта Гостиная 1,6 м ●▶/kvinta.jpg",
            "images/products/Квинта Гостиная 1,6 м ●▶/kvinta1.jpg",
            "images/products/Квинта Гостиная 1,6 м ●▶/kvinta2.jpg"
        ],
        description: "Современная гостиная без шкафа «Квинта». Отлично подходит для квартиры или дома.",
        specs: {
            "Размер": "1600х1600х350 мм",
            "Материал": "ЛДСП / МДФ",
            "Гарантия": "18 месяцев",
            "Цвет корпуса": "Белый лофт",
            "Цвет фасада": "Софт айс"
        }
    },
    {
        id: 5,
        name: "Ирис Гостиная ●▶",
        category: "Гостиные",
        subcategory: "Гостиные без шкафа",
        price: "21 000p",
        preview: "images/products/Ирис Гостиная ●▶/iris.jpg",
        images: [
            "images/products/Ирис Гостиная ●▶/iris.jpg",
            "images/products/Ирис Гостиная ●▶/iris1.jpg",
        ],
        description: "Современная гостиная без шкафа «Ирис». Отлично подходит для квартиры или дома.",
        specs: {
            "Направляющие": "Шариковые полного выдвижения",
            "Размер": "2085х2000х425 мм",
            "Ниша под ТВ": "935х810х405",
            "Материал": "ЛДСП / ЛДСП",
            "Гарантия": "12 месяцев",
            "Цвет корпуса": "Дуб крафт золото",
            "Цвет фасада": "Белый шагрень"
        }
    },
    {
        id: 6,
        name: "Сиена Гостиная",
        category: "Гостиные",
        subcategory: "Гостиные со шкафом",
        price: "26 000p",
        preview: "images/products/Сиена Гостиная/siena.jpg",
        images: [
            "images/products/Сиена Гостиная/siena.jpg",
            "images/products/Сиена Гостиная/siena1.jpg",
        ],
        description: "Современная гостиная со шкафом «Сиена». Отлично подходит для квартиры или дома.",
        specs: {
            "Направляющие": "Роликовые",
            "Размер": "2600х1940х415 мм",
            "Ниша под ТВ": "1000х775х330",
            "Материал": "ЛДСП / ЛДСП",
            "Гарантия": "12 месяцев",
            "Цвет корпуса": "Венге",
            "Цвет фасада": "Дуб белфорт"
        } 
    },
    {
        id: 7,
        name: "Софи Гостиная",
        category: "Гостиные",
        subcategory: "Гостиные со шкафом",
        price: "29 000p",
        preview: "images/products/Софи Гостиная/sofi.jpg",
        images: [
            "images/products/Софи Гостиная/sofi.jpg",
            "images/products/Софи Гостиная/sofi1.jpg",
        ],
        description: "Современная гостиная со шкафом «Софи». Отлично подходит для квартиры или дома.",
        specs: {
            "Размер": "2300х1940х505 мм",
            "Ниша под ТВ": "1100х745х505",
            "Материал": "ЛДСП / ЛДСП",
            "Гарантия": "12 месяцев",
            "Цвет корпуса": "Ясень шимо темный",
            "Цвет фасада": "Ясень шимо светлый"
        } 
    },
    {
    id: 8,
        name: "Моника Гостиная - 1",
        category: "Гостиные",
        subcategory: "Гостиные со шкафом",
        price: "39 000p",
        preview: "images/products/Моника Гостиная - 1/monika.jpg",
        images: [
            "images/products/Моника Гостиная - 1/monika.jpg",
            "images/products/Моника Гостиная - 1/monika1.jpg"
        ],
        description: "Современная гостиная со шкафом «Моника». Отлично подходит для квартиры или дома.",
        specs: {
            "Размер": "3000х2100х500 мм",
            "Направляющие": "Шариковые без доводчиков",
            "Материал": "ЛДСП / ЛДСП",
            "Ниша под ТВ": "1600х1180",
            "Гарантия": "18 месяцев",
            "Цвет корпуса": "Айрон рок",
            "Цвет фасада": "Белый лофт"
        }
    },
    {
    id: 9,
        name: "Либерти ГС 01 Гостиная",
            category: "Гостиные",
            subcategory: "Гостиные со шкафом",
            price: "41 000p",
            preview: "images/products/Либерти ГС 01 Гостиная/liberti.jpg",
            images: [
                "images/products/Либерти ГС 01 Гостиная/liberti.jpg",
                "images/products/Либерти ГС 01 Гостиная/liberti1.jpg"
            ],
            description: "Современная гостиная со шкафом «Либерти». Отлично подходит для квартиры или дома.",
            specs: {
                "Размер": "2800х2100х400 мм",
                "Направляющие": "Шариковые полного выдвижения",
                "Материал": "ЛДСП / МДФ",
                "Ниша под ТВ": "1200",
                "Гарантия": "12 месяцев",
                "Цвет корпуса": "Венге",
                "Цвет фасада": "Белый глянец"
            }
        },
        {
            id: 10,
            name: "Дели-4 обувница",
            category: "Прихожие",
            subcategory: "Тумба для обуви",
            price: "8 000p",
            preview: "images/products/Дели-4 обувница/deli.jpg",
            images: [
                "images/products/Дели-4 обувница/deli.jpg"
            ],
            description: "Современная тумба для обуви «Дели». Отлично подходит для квартиры или дома.",
            specs: {
            "Размер": "950х1020х335 мм",
            "Материал": "ЛДСП / ЛДСП",
            "Гарантия": "12 месяцев",
            "Цвет корпуса": "Венге",
            "Цвет фасада": "Дуб белфорт"
        }
        },
        {
        id: 11,
        name: "Сириус Тумба для обуви 60х143",
        category: "Прихожие",
        subcategory: "Тумба для обуви",
        price: "9 000p",
        preview: "images/products/Сириус Тумба для обуви 60х143/sirius1.jpg",
        images: [
            "images/products/Сириус Тумба для обуви 60х143/sirius1.jpg",
            "images/products/Сириус Тумба для обуви 60х143/sirius.jpg"
        ],
        description: "Современная тумба для обуви «Сириус». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "602х1428х250 мм",
        "Материал": "Кашированное ДСП/ ДСП",
        "Гарантия": "24 месяца",
        "Цвет корпуса": "Белый"
    }
    },
    {
        id: 12,
        name: "Дебора Прихожая",
        category: "Прихожие",
        subcategory: "Набор в прихожую",
        price: "9000р",
        preview: "images/products/Дебора Прихожая/debora1.jpg",
        images:[
            "images/products/Дебора Прихожая/debora1.jpg",
            "images/products/Дебора Прихожая/debora.jpg"
        ],
        description: "Современная Прихожая «Дебора». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "900х1840х290",
        "Направляющие": "Роликовые",
        "Материал": "ЛДСП / ЛДСП",
        "Гарантия": "12 месяцев",
        "Цвет корпуса": "Дуб сонома",
        "Цвет фасада": "Дуб сонома"
        }
    },
    {
    id: 13,
    name: "Сорренто Прихожая",
    category: "Прихожие",
    subcategory: "Набор в прихожую",
    price: "10 000р",
    preview: "images/products/Сорренто Прихожая/sorento.jpg",
    images:[
        "images/products/Сорренто Прихожая/sorento.jpg",
        "images/products/Сорренто Прихожая/sorento1.jpg"
    ],
    description: "Современная Прихожая «Сорренто». Отлично подходит для квартиры или дома.",
    specs: {
    "Размер": "910х2020х345 мм",
    "Направляющие": "Роликовые",
    "Материал": "ЛДСП / ЛДСП",
    "Гарантия": "12 месяцев",
    "Цвет корпуса": "Ясень шимо темный",
    "Цвет фасада": "Ясень шимо светлый"
    }  
    },
    {
    id: 14,
    name: "Денвер Прихожая",
    category: "Прихожие",
    subcategory: "Набор в прихожую",
    price: "16 000р",
    preview: "images/products/Денвер Прихожая/denver.jpg",
    images:[
        "images/products/Денвер Прихожая/denver.jpg",
        "images/products/Денвер Прихожая/denver1.jpg"
    ],
    description: "Современная Прихожая «Денвер». Отлично подходит для квартиры или дома.",
    specs: {
    "Размер": "1000х2020х355 мм",
    "Направляющие": "Шариковые",
    "Материал": "ЛДСП / ЛДСП",
    "Гарантия": "12 месяцев",
    "Цвет корпуса": "Ателье светлый",
    "Цвет фасада": "Белый шагрень"
    }
    },
    {
        id: 15,
        name: "Ирис ПР-01 Прихожая",
        category: "Прихожие",
        subcategory: "Набор в прихожую",
        price: "16 000р",
        preview: "images/products/Ирис ПР-01 Прихожая/iris.jpg",
        images:[
            "images/products/Ирис ПР-01 Прихожая/iris.jpg",
            "images/products/Ирис ПР-01 Прихожая/iris1.jpg"
        ],
        description: "Современная Прихожая «Ирис». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "1350х2000х455 мм",
        "Материал": "ЛДСП / ЛДСП / Зеркало",
        "Гарантия": "12 месяцев",
        "Цвет корпуса": "Дуб крафт золото",
        "Цвет фасада": "Белый шагрень"
        }
    },
    {
        id: 16,
        name: "Юкки ПР 1400 Прихожая",
        category: "Прихожие",
        subcategory: "Модульная прихожая",
        price: "17 000р",
        preview: "images/products/Юкки ПР 1400 Прихожая/ukki1.jpg",
        images:[
        "images/products/Юкки ПР 1400 Прихожая/ukki1.jpg",
        "images/products/Юкки ПР 1400 Прихожая/ukki.jpg"
        ],
        description: "Современная Модульная прихожая «Юкки». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "1400х2000х415 мм",
        "Направляющие": "Шариковые",
        "Материал": "ЛДСП / ЛДСП",
        "Гарантия": "12 месяцев",
        "Цвет корпуса": "Дуб делано",
        "Цвет фасада": "Белый шагрень"
        } 
    },
    {
        id: 17,
        name: "Орегон ПР 01 Прихожая",
        category: "Прихожие",
        subcategory: "Модульная прихожая",
        price: "10 000р",
        preview: "images/products/Орегон ПР 01 Прихожая/oregon.jpg",
        images:[
        "images/products/Орегон ПР 01 Прихожая/oregon.jpg"
        ],
        description: "Современная Модульная прихожая Орегон». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "800х2100х400 мм",
        "Направляющие": "Шариковые",
        "Материал": "ЛДСП / МДФ",
        "Гарантия": "12 месяцев",
        "Цвет корпуса": "Дуб крафт табачный",
        "Цвет фасада": "Белый супермат, дуб крафт табачный"
        }
    },
    {
        id: 18,
        name: "Милана Прихожая",
        category: "Прихожие",
        subcategory: "Набор в прихожую",
        price: "14 000р",
        preview: "images/products/Милана Прихожая/milana.jpg",
        images:[
            "images/products/Милана Прихожая/milana.jpg"
        ],
        description: "Современная Прихожая «Милана». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "1100х2200х450 мм",
        "Материал": "ЛДСП / ЛДСП",
        "Гарантия": "18 месяцев",
        "Цвет корпуса": "Гаскон пайн",
        "Цвет фасада": "Белый лофт"
        }
    },
    {
        id: 19,
        name: "Соната ПР 01 Прихожая",
        category: "Прихожие",
        subcategory: "Модульная прихожая",
        price: "15 000р",
        preview: "images/products/Соната ПР 01 Прихожая/sonata.jpg",
        images:[
            "images/products/Соната ПР 01 Прихожая/sonata.jpg"
        ],
        description: "Современная Модульная прихожая «Соната». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "1000х2100х400 мм",
        "Направляющие": "Шариковые",
        "Материал": "ЛДСП / МДФ",
        "Гарантия": "12 месяцев",
        "Цвет корпуса": "Дуб крафт табачный",
        "Цвет фасада": "Моно керамика"
        }
    },
    {
        id: 20,
        name: "Стил Прихожая",
        category: "Прихожие",
        subcategory: "Набор в прихожую",
        price: "18 000р",
        preview: "images/products/Стил Прихожая правая/stil.jpg",
        images:[
            "images/products/Стил Прихожая правая/stil.jpg"
        ],
        description: "Современная Прихожая «Стил». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "1150х2100х400 мм",
        "Направляющие": "Шариковые",
        "Материал": "ЛДСП / ЛДСП",
        "Гарантия": "18 месяцев",
        "Цвет корпуса": "Темно-серый лофт",
        "Цвет фасада": "Дуб золотистый"
        }
    },
    {
        id: 21,
        name: "Санса ПР 01 Прихожая",
        category: "Прихожие",
        subcategory: "Модульная прихожая",
        price: "12 000р",
        preview: "images/products/Санса ПР 01 Прихожая/sansa.jpg",
        images:[
            "images/products/Санса ПР 01 Прихожая/sansa.jpg"
        ],
        description: "Современная Модульная прихожая «Санса». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "1000х2100х500 мм",
        "Направляющие": "Шариковые",
        "Материал": "ЛДСП / ЛДСП",
        "Гарантия": "12 месяцев",
        "Цвет корпуса": "Дуб сонома",
        "Цвет фасада": "Белый"
        }
    },
    {
        id: 22,
        name: "Квинта Гостиная 2,0 м",
        category: "Гостиные",
        subcategory: "Гостиные без шкафа",
        price: "18 000р",
        preview: "images/products/Квинта Гостиная 2,0 м/kvinta.jpg",
        images:[
        "images/products/Квинта Гостиная 2,0 м/kvinta.jpg",
        "images/products/Квинта Гостиная 2,0 м/kvinta1.jpg",
        "images/products/Квинта Гостиная 2,0 м/kvinta2.jpg"
        ],
        description: "Современная Гостиная «Квинта». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "2000х1600х350 мм",
        "Направляющие": "Шариковые",
        "Материал": "ЛДСП / МДФ",
        "Гарантия": "18 месяцев",
        "Цвет корпуса": "Темно-серый лофт",
        "Цвет фасада": "Силк Титан"
        }
    },
    {
        id: 23,
        name: "Гранд",
        category: "Гостиные",
        subcategory: "Модульные гостиные",
        price: "15 000р",
        preview: "images/products/Гранд/grand.jpg",
        images:[
        "images/products/Гранд/grand.jpg"
        ],
        description: "Современная Модульная гостиная «Гранд». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "2900х2120х490 мм",
        "Ниша под ТВ": "1200х940",
        "Материал": "ЛДСП / ЛДСП",
        "Гарантия": "12 месяцев",
        "Цвет корпуса": "Дуб крафт белый",
        "Цвет фасада": "Дуб крафт белый"
        }
    },
    {
        id: 24,
        name: "Стандарт Стол-книжка",
        category: "Малые формы",
        subcategory: "Столы-книжки",
        price: "5 000р",
        preview: "images/products/Стандарт Стол-книжка/stolknijka.jpg",
        images:[
        "images/products/Стандарт Стол-книжка/stolknijka.jpg",
        "images/products/Стандарт Стол-книжка/stolknijka1.jpg",
        "images/products/Стандарт Стол-книжка/stolknijka2.jpg"
        ],
        description: "Современная Стол-книжка. Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "230х750х800 мм",
        "Материал": "ЛДСП / ЛДСП",
        "Гарантия": "12 месяцев",
        "Цвет столешницы": "Ясень шимо темный",
        "Цвет фасада": "Ясень шимо темный"
        }
    },
    {
        id: 25,
        name: "Лима Тумба ТВА",
        category: "Малые формы",
        subcategory: "Тумбы TBA",
        price: "10 000р",
        preview: "images/products/Лима Тумба ТВА/lima.jpg",
        images:[
        "images/products/Лима Тумба ТВА/lima.jpg"
        ],
        description: "Современная Тумба ТВА. Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "1500х1520х435 мм",
        "Ниша под ТВ": "1100х730х435",
        "Материал": "ЛДСП / ЛДСП",
        "Гарантия": "12 месяцев",
        "Цвет корпуса": "Ясень шимо темный",
        "Цвет фасада": "Ясень шимо светлый"
        }
    },
    {
        id: 26,
        name: "Юкки ТВ 1600 Тумба ТВА",
        category: "Малые формы",
        subcategory: "Тумбы TBA",
        price: "8 000р",
        preview: "images/products/Юкки ТВ 1600 Тумба ТВА/ukki.jpg",
        images:[
        "images/products/Юкки ТВ 1600 Тумба ТВА/ukki.jpg"
        ],
        description: "Современная Тумба ТВА «Юкки». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "1600х510х450 мм",
        "Материал": "ЛДСП / ЛДСП",
        "Гарантия": "12 месяцев",
        "Цвет корпуса": "Дуб делано",
        "Цвет фасада": "Белый шагрень"
        }
    },
    {
        id: 27,
        name: "Орегон ТВ 01 Тумба под ТВ",
        category: "Малые формы",
        subcategory: "Тумбы TBA",
        price: "9 000р",
        preview: "images/products/Орегон ТВ 01 Тумба под ТВ/oregon.jpg",
        images:[
        "images/products/Орегон ТВ 01 Тумба под ТВ/oregon.jpg"
        ],
        description: "Современная Тумба ТВА «Орегон». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "1400х500х400 мм",
        "Материал": "ЛДСП / МДФ",
        "Гарантия": "12 месяцев",
        "Цвет корпуса": "Дуб крафт табачный",
        "Цвет фасада": "Белый супермат, дуб крафт табачный"
        }
    },
    {
        id: 28,
        name: "Соната ТВ 01 Тумба ТВ",
        category: "Малые формы",
        subcategory: "Тумбы TBA",
        price: "7 000р",
        preview: "images/products/Соната ТВ 01 Тумба ТВ/sonata.jpg",
        images:[
        "images/products/Соната ТВ 01 Тумба ТВ/sonata.jpg"
        ],
        description: "Современная Тумба ТВА «Соната». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "1200х365х400 мм",
        "Направляющие": "Шариковые",
        "Материал": "ЛДСП / МДФ",
        "Гарантия": "12 месяцев",
        "Цвет корпуса": "Дуб крафт табачный",
        "Цвет фасада": "Моно керамика"
        }
    },
    {
        id: 29,
        name: "Сицилия Полка настенная открытая",
        category: "Малые формы",
        subcategory: "Полки навесные",
        price: "3 000р",
        preview: "images/products/Сицилия Полка настенная открытая/sicilia.jpg",
        images:[
        "images/products/Сицилия Полка настенная открытая/sicilia.jpg"
        ],
        description: "Современная Полка настенная «Сицилия». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "1200х300х300 мм",
        "Направляющие": "Шариковые",
        "Материал": "ЛДСП / ЛДСП",
        "Гарантия": "18 месяцев",
        "Цвет корпуса": "Дуб альпийский",
        "Цвет фасада": "Тефия"
        }
    },
    {
        id: 30,
        name: "Киви ПЛ 01 Полка навесная",
        category: "Малые формы",
        subcategory: "Полки навесные",
        price: "2 000р",
        preview: "images/products/Киви ПЛ 01 Полка навесная/kivi.jpg",
        images:[
        "images/products/Киви ПЛ 01 Полка навесная/kivi.jpg"
        ],
        description: "Современная Полка настенная «Киви». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "934х356х300 мм",
        "Материал": "ЛДСП / ЛДСП",
        "Гарантия": "12 месяцев",
        "Цвет корпуса": "Дуб делано",
        "Цвет фасада": "Белый супермат"
        }
    },
    {
        id: 31,
        name: "Ирис ПЛ-02 Полка универсальная",
        category: "Малые формы",
        subcategory: "Полки навесные",
        price: "3 000р",
        preview: "images/products/Ирис ПЛ-02 Полка универсальная/iris.jpg",
        images:[
        "images/products/Ирис ПЛ-02 Полка универсальная/iris.jpg"
        ],
        description: "Современная Полка настенная «Ирис». Отлично подходит для квартиры или дома.",
        specs: {
        "Размер": "1100х400х335 мм",
        "Материал": "ЛДСП / ЛДСП",
        "Гарантия": "12 месяцев",
        "Цвет корпуса": "Дуб крафт золото",
        "Цвет фасада": "Белый шагрень"
        }
    },


];